<a href="https://colab.research.google.com/github/teeranutp/code-everyday002/blob/master/NumpyPandas001.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Numpy and Pandas

In [20]:
import numpy as np
import pandas as pd

In [21]:
house = "/content/sample_data/california_housing_train.csv"

In [22]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [23]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

#Series no headline

In [24]:
df[:]["median_house_value"].mean()

207300.91235294117

#Dataframe have headline

In [25]:
df[:][["median_income", "median_house_value"]]

       median_income  median_house_value
0             1.4936             66900.0
1             1.8200             80100.0
2             1.6509             85700.0
3             3.1917             73400.0
4             1.9250             65500.0
...              ...                 ...
16995         2.3571            111400.0
16996         2.5179             79000.0
16997         3.0313            103600.0
16998         1.9797             85800.0
16999         3.0147             94600.0

[17000 rows x 2 columns]

In [26]:
df[["median_income", "median_house_value"]]

       median_income  median_house_value
0             1.4936             66900.0
1             1.8200             80100.0
2             1.6509             85700.0
3             3.1917             73400.0
4             1.9250             65500.0
...              ...                 ...
16995         2.3571            111400.0
16996         2.5179             79000.0
16997         3.0313            103600.0
16998         1.9797             85800.0
16999         3.0147             94600.0

[17000 rows x 2 columns]

In [27]:
df[["median_house_value"]].sample(10)

       median_house_value
7957             424000.0
16454            301500.0
10465             65000.0
13839            441400.0
9692              99500.0
7543             243100.0
2230             148900.0
16244            303700.0
10751             70200.0
546              193500.0

#Column

In [28]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

#Describe

In [29]:
df.describe()

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

In [31]:
len(df[["median_income", "median_house_value"]])

17000